# 11.22-------------------------------------------------------------------------------------
# 시침과 분침의 각도 차가 90도가 될 때의 시각을 hh:mm 의 형태로 나타내여야함

for i in range(12):
    for j in range(60):
        # 시침 = ((30 * i) + (j * 0.5))
        # 분침 = (j * 6)
        if ((j * 6) - ((30 * i) + (j * 0.5)) == 270 or (j * 6) - ((30 * i) + (j * 0.5)) == 90 
        or ((30 * i) + (j * 0.5)) - (j * 6) == 90 or ((30 * i) + (j * 0.5)) - (j * 6) == 270):
            print(i,':',j)

# 정확한 90도, 270도라서 3시와 9시만 나온다


# 9시 이후 오류
for i in range(0,12):
# i=0
# while (i < 12):
    a = ((90 + (30 * i)) // 5.5)
    b = ((270 + (i * 30)) // 5.5)
    # print('1번째',a // 60,a%60)
    # print('2번째',b // 60,b % 60,'\n')
    if (a // 60 > 0):
        i+=1
    print(i,a % 60)
    if (b // 60 > 0):
        i+=1
    print(i,b % 60)
    # print(b)
    i+=1


# 선생님 코드
for i in range(90,330 * 12, 180):
    h = int(i/330)
    m = int(i / 5.5 - 60*h)
    print('%002d:%002d' % (h,m))



# 팩토리얼의 마지막 연속된 0의 개수를 구해라
import math
fac = str(math.factorial(100))
print(fac)
n =0
while fac[-(n+1)] == '0':
    n+=1
print(n)